Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHitTypesConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHitTypesConvertor class provides a set of extension methods for converting values
between the Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitTypes and Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes types.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHitTypesConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes)
Converts a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes to a value of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitTypes.
hitTypes: The value to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitTypes value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationHitTypesConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitTypes)
Converts a value of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationHitTypes to a value of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes.
hitTypes: The value to convert.
Returns: The converted Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationHitTypes value.